app/Http/Controllers/Log/StorePendudukMasukController.php

insert into `penduduks` (`nama`, `nik`, `no_keluarga_sebelumnya`, `tempat_lahir`, `tanggal_lahir`, `attr_kelamin_id`, `attr_pendidikan_id`, `attr_pendidikan_keluarga_id`, `attr_status_id`, `attr_agama_id`, `attr_pekerjaan_id`, `attr_hubungan_id`, `attr_status_kawin_id`, `attr_suku_id`, `attr_golongan_darah_id`, `attr_warganegara_id`, `attr_bahasa_id`, `alamat`, `dusun_id`, `rukun_warga_id`, `rukun_tetangga_id`, `nama_ayah`, `nik_ayah`, `nama_ibu`, `nik_ibu`, `ket`, `paspor`, `kitas`, `foto`, `tlp`, `email`, `tanggal_paspor`, `tanggal_lapor`, `tanggal_masuk`, `tanggal_perceraian`, `tanggal_pernikahan`, `no_akta_pernikahan`, `no_akta_perceraian`, `no_bpjs`, `no_akta_kelahiran`, `waktu_kelahiran`, `berat_kelahiran`, `panjang_kelahiran`, `penolong_kelahiran`, `tempat_dilahirkan`, `jenis_kelahiran`, `anak_ke`, `created_by`, `updated_by`, `updated_at`, `created_at`) values ('Vero', '1906060909211851', '', 'Goa Boma', '2023-01-20', '1', '', '1', '1', '2', '1', '4', '1', '1', '4', '1', '3', 'JL. RAYA GOA BOMA RT 01', '2', '2', '2', 'F.Nanang', '', 'Juliana', '', '', '', '', '{}', '081254504300', 'dricko0798@gmail.com', '', '2023-01-20', '2023-01-20', '', '', '', '', '', 'L-001', '12:00', '3000', '52', 'dokter', 'polindes', 'tunggal', '2', 1, 1, '2023-01-20 23:40:45', '2023-01-20 23:40:45')
update `penduduks` set `foto` = 'desa/penduduk/foto/2Xponh3UTXzTKN4MjECHvXO7Dx2RayF8nPiWME7j.jpg', `penduduks`.`updated_at` = '2023-01-20 23:40:45' where `id` = 402
insert into `log_penduduk_masuks` (`penduduk_id`, `tanggal_lapor`, `tanggal_masuk`, `created_by`, `updated_by`, `updated_at`, `created_at`) values (402, '2023-01-20', '2023-01-20', 1, 1, '2023-01-20 23:40:45', '2023-01-20 23:40:45')
---
    public function __invoke(StorePendudukRequest $request)
    {
        abort_if(!Gate::allows('update penduduk'), 403);
        try {
            DB::beginTransaction();

            $penduduk = Penduduk::create($request->validated());
            if ($request->file('foto')) {
                // jika ada upload foto baru
                $path = $request->file('foto')->store('desa/penduduk/foto');
                $penduduk->forceFill([
                    'foto' => $path
                ])->save();
            }
            LogPendudukMasuk::create([
                'penduduk_id' => $penduduk->id,
                'tanggal_lapor' => $request->tanggal_lapor,
                'tanggal_masuk' => $request->tanggal_masuk
            ]);