app/Http/Controllers/Log/StorePendudukLahirController.php

update `penduduks` set `foto` = 'desa/penduduk/foto/LwTbwY8pAmatiQRxxCrWxT12VQ8aolrVQF6Ya2Tn.jpg', `penduduks`.`updated_at` = '2023-01-20 23:38:32' where `id` = 401
insert into `penduduks` (`nama`, `nik`, `no_keluarga_sebelumnya`, `tempat_lahir`, `tanggal_lahir`, `attr_kelamin_id`, `attr_pendidikan_id`, `attr_pendidikan_keluarga_id`, `attr_status_id`, `attr_agama_id`, `attr_pekerjaan_id`, `attr_hubungan_id`, `attr_status_kawin_id`, `attr_suku_id`, `attr_golongan_darah_id`, `attr_warganegara_id`, `attr_bahasa_id`, `alamat`, `dusun_id`, `rukun_warga_id`, `rukun_tetangga_id`, `nama_ayah`, `nik_ayah`, `nama_ibu`, `nik_ibu`, `ket`, `paspor`, `kitas`, `foto`, `tlp`, `email`, `tanggal_paspor`, `tanggal_lapor`, `tanggal_masuk`, `tanggal_perceraian`, `tanggal_pernikahan`, `no_akta_pernikahan`, `no_akta_perceraian`, `no_bpjs`, `no_akta_kelahiran`, `waktu_kelahiran`, `berat_kelahiran`, `panjang_kelahiran`, `penolong_kelahiran`, `tempat_dilahirkan`, `jenis_kelahiran`, `anak_ke`, `created_by`, `updated_by`, `updated_at`, `created_at`) values ('Dandi Riko', '1906060909211876', '', 'Goa Boma', '1998-07-29', '1', '2', '2', '1', '2', '3', '1', '2', '49', '3', '1', '2', 'JL. RAYA GOA BOMA RT 01', '3', '3', '3', 'F.Nanang', '', 'Juliana', '', '', '', '', '{}', '081254504398', 'dricko0798@gmail.com', '', '2023-01-20', '2023-01-20', '', '2022-01-06', 'T-0001', '', '', 'L-001', '12:00', '3000', '52', 'dukun', 'puskesmas', 'tunggal', '1', 1, 1, '2023-01-20 23:38:31', '2023-01-20 23:38:31')
insert into `log_penduduk_lahirs` (`penduduk_id`, `tanggal_lapor`, `created_by`, `updated_by`, `updated_at`, `created_at`) values (401, '2023-01-20', 1, 1, '2023-01-20 23:38:32', '2023-01-20 23:38:32')
---
    public function __invoke(StorePendudukRequest $request)
    {
        try {
            DB::beginTransaction();

            $penduduk = Penduduk::create($request->validated());
            if ($request->file('foto')) {
                // jika ada upload foto baru
                $path = $request->file('foto')->store('desa/penduduk/foto');
                $penduduk->forceFill([
                    'foto' => $path
                ])->save();
            }
            LogPendudukLahir::create([
                'penduduk_id' => $penduduk->id,
                'tanggal_lapor' => $request->tanggal_lapor,
            ]);