app/Services/BlogDataService.php

    public function __construct()
    {
        $this->blog = Blog::all();
---
select * from `blogs`