app/Services/PendudukDataService.php

    public function getDataPendudukLaki()
    {
        $jmlPendudukLaki =  Penduduk::count('attr_kelamin_id', 1);
---
select count(`attr_kelamin_id`) as aggregate from `penduduks`

    public function getDataPendudukPerempuan()
    {
        $jmlPendudukPerempuan =  Penduduk::count('attr_kelamin_id', 1);
---
select count(`attr_kelamin_id`) as aggregate from `penduduks`

    public function getDataJumlahPenduduk()
    {
        $jmlPenduduk = Penduduk::count();
---
select count(*) as aggregate from `penduduks`

    public function getDataJumlahKeluarga()
    {
        $jmlKeluarga = Keluarga::count();
---
select count(*) as aggregate from `keluargas`

    public function getDataAgamas($jmlPenduduk)
    {
        // chart donut agama
        $dataAgama = collect();
        $agama = AttrAgama::withCount('penduduk')->orderBy('penduduk_count', 'asc')->get();
---
select `attr_agamas`.*, (select count(*) from `penduduks` where `attr_agamas`.`id` = `penduduks`.`attr_agama_id`) as `penduduk_count` from `attr_agamas` order by `penduduk_count` asc

    public function getDataKawins($jmlPenduduk)
    {
        // chart donut status kawin
        $dataKawin = collect();
        $kawin = AttrStatusKawin::withCount('penduduk')->orderBy('penduduk_count', 'asc')->get();
---
select `attr_status_kawins`.*, (select count(*) from `penduduks` where `attr_status_kawins`.`id` = `penduduks`.`attr_status_kawin_id`) as `penduduk_count` from `attr_status_kawins` order by `penduduk_count` asc