app/Http/Controllers/Keluarga/CreatePendudukMasukController.php

    public function __invoke(Request $request)
    {
        abort_if(!Gate::allows('create keluarga'), 403);
        $agama = AttrAgama::all();
        $pendidikan = AttrPendidikan::all();
        $pendidikanKK = AttrPendidikanKeluarga::all();
        $kelamin = AttrKelamin::all();
        $bahasa = AttrBahasa::all();
        $suku = AttrSuku::all();
        $status = AttrStatus::all();
        $statusDasar = AttrStatusDasar::all();
        $statusKawin = AttrStatusKawin::all();
        $hubungan = AttrHubungan::all();
        $hubunganKK = AttrHubunganKeluarga::all();
        $pekerjaan = AttrPekerjaan::all();
        $warganegara = AttrWarganegara::all();
        $dusun = Dusun::all();
        $golonganDarah = AttrGolonganDarah::all();
---
select * from `attr_agamas`
select * from `attr_pendidikans`
select * from `attr_pendidikan_keluargas`
select * from `attr_kelamins`
select * from `attr_bahasas`
select * from `attr_sukus`
select * from `attr_statuses`
select * from `attr_status_dasars`
select * from `attr_status_kawins`
select * from `attr_hubungans`
select * from `attr_hubungan_keluargas`
select * from `attr_pekerjaans`
select * from `attr_warganegaras`
select * from `dusuns`
select * from `attr_golongan_darahs`