app/Http/Controllers/Desa/Penduduk/PendudukController.php

                })
                ->make(true);
        }
        $statusPenduduk = AttrStatus::all();
        $kelaminPenduduk = AttrKelamin::all();
---
select * from `attr_statuses`
select * from `attr_kelamins`