app/Http/Controllers/Desa/KeluargaController.php

    public function index(Request $request)
    {
        abort_if(!Gate::allows('read keluarga'), 403);
        if ($request->ajax()) {
            $model = Keluarga::withCount('penduduks')->with(['penduduks' => function ($query) {
                $query->where('attr_hubungan_id', 1);
            }])->latest();
            return DataTables::eloquent($model)
                ->addIndexColumn()
                ->addColumn('foto', function($model){
                    if ($model->penduduks->count()) {
                        return $model->penduduks->first()->foto_url;
                    }

                })
                ->addColumn('nik', function($model){
                    if ($model->penduduks->count()) {
                        return $model->penduduks->first()->nik;
                    } else {
                        return '-';
                    }
                })
                ->addColumn('nama', function($model){
                    if ($model->penduduks->count()) {
                        return $model->penduduks->first()->nama;
                    } else {
                        return '-';
                    }
                })
                ->addColumn('jenis_kelamin', function($model){
                    if ($model->penduduks->count()) {
                        return $model->penduduks->first()->attrKelamin->nama;
                    } else {
                        return '-';
                    }
                })
                ->addColumn('alamat_penduduk', function($model){
                    if ($model->penduduks->count()) {
                        return $model->penduduks->first()->alamat;
                    } else {
                        return '-';
                    }
                })
                ->addColumn('dusun', function($model){
                    if ($model->penduduks->count()) {
                        return $model->penduduks->first()->dusun->nama_dusun;
                    } else {
                        return '-';
                    }
                })
                ->addColumn('rw', function($model){
                    if ($model->penduduks->count()) {
                        return $model->penduduks->first()->rukunWarga->nama_rw;
                    } else {
                        return '-';
                    }
                })
                ->addColumn('rt', function($model){
                    if ($model->penduduks->count()) {
                        return $model->penduduks->first()->rukunTetangga->nama_rt;
                    } else {
                        return '-';
                    }
                })
                ->make(true);
---
select * from `attr_kelamins` where `attr_kelamins`.`id` = 1 limit 1
select * from `dusuns` where `dusuns`.`id` = 1 limit 1
select * from `rukun_wargas` where `rukun_wargas`.`id` = 1 limit 1
select * from `rukun_tetanggas` where `rukun_tetanggas`.`id` = 1 limit 1

    public function create()
    {
        abort_if(!Gate::allows('create keluarga'), 403);
        $penduduks = Penduduk::where('keluarga_id', null)->where('attr_hubungan_id', 1)->get();
---
select * from `penduduks` where `keluarga_id` is null and `attr_hubungan_id` = 1