app/Http/Controllers/DropdownController.php

    public function fetchRw(Request $request)
    {
        $data['rw'] = RukunWarga::where("dusuns_id", $request->dusuns_id)
            ->get(["nama_rw", "id"]);
---
select `nama_rw`, `id` from `rukun_wargas` where `dusuns_id` = '3'

    public function fetchRt(Request $request)
    {
        $data['rt'] = RukunTetangga::where("rukun_wargas_id", $request->rukun_wargas_id)
            ->get(["nama_rt", "id"]);
---
select `nama_rt`, `id` from `rukun_tetanggas` where `rukun_wargas_id` = '3'