app/Http/Controllers/HomeController.php

select * from `blogs` order by `created_at` desc limit 1
select * from `blogs` where `status` = 1 order by `created_at` desc limit 6 offset 0
select * from `categories` where `categories`.`id` in (1, 2, 3)
select * from `comments` where `comments`.`blog_id` in (64, 65, 66, 67, 68, 101) and `status` = 2
select `tags`.*, `blog_tag`.`blog_id` as `pivot_blog_id`, `blog_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `blog_tag` on `tags`.`id` = `blog_tag`.`tag_id` where `blog_tag`.`blog_id` in (64, 65, 66, 67, 68, 101)
select * from `jabatans` where `jabatans`.`id` in (1, 2, 3, 4)
select * from `pegawais`
---
    public function __invoke(Request $request,PendudukDataService $pendudukDataService)
    {
        $misi = json_decode(settings()->group('desa')->get('misi'));
        $firstBlog = Blog::latest()->first();
        // blog
        $blogs = Blog::with(['category', 'tags', 'creator', 'comments' => function ($q) {
            $q->where('status', 2);
        }])->cari($request->cari_blog)->published()->latest()->paginate(6);

        $pegawais = Pegawai::with('jabatan')->get();